/*********************************************************************************************************************
* RT1064DVL6A Opensourec Library 即（RT1064DVL6A 开源库）是一个基于官方 SDK 接口的第三方开源库
* Copyright (c) 2022 SEEKFREE 逐飞科技
* 
* 本文件是 RT1064DVL6A 开源库的一部分
* 
* RT1064DVL6A 开源库 是免费软件
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
* 
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
* 
* 您应该在收到本开源库的同时收到一份 GPL 的副本
* 如果没有，请参阅<https://www.gnu.org/licenses/>
* 
* 额外注明：
* 本开源库使用 GPL3.0 开源许可证协议 以上许可申明为译文版本
* 许可申明英文版在 libraries/doc 文件夹下的 GPL3_permission_statement.txt 文件中
* 许可证副本在 libraries 文件夹下 即该文件夹下的 LICENSE 文件
* 欢迎各位使用并传播本程序 但修改内容时必须保留逐飞科技的版权声明（即本声明）
* 
* 文件名称          main
* 公司名称          成都逐飞科技有限公司
* 版本信息          查看 libraries/doc 文件夹内 version 文件 版本说明
* 开发环境          IAR 8.32.4 or MDK 5.33
* 适用平台          RT1064DVL6A
* 店铺链接          https://seekfree.taobao.com/
* 
* 修改记录
* 日期              作者                备注
* 2022-09-21        SeekFree            first version
********************************************************************************************************************/

#include "zf_common_headfile.h"

// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project->clean  等待下方进度条走完

// *************************** 例程测试说明 ***************************
//本例程主要展示如何对缓存进行操作
//关于缓存的刷新，很多人问为什么要刷新缓存？这里进举例一个情况，例如我们使用DMA对一个数组进行了写入操作，
//然后我在去读取数组的数据的话，你会发现读取的数据还是以前的并不是DMA刚写入的数据，因为数据写入是通过DMA操作的，
//因此CPU是不知道数据已经变更了，如果去读取数据的话其实还是读取的缓存数据，这个时候我们就需要去刷新一下缓存，
//然后在去读取数据。


uint8 test[50];
int main(void)
{
    clock_init(SYSTEM_CLOCK_600M);  // 不可删除
    debug_init();                   // 调试端口初始化
    
    // 此处编写用户代码 例如外设初始化代码等

    L1CACHE_DisableDCache();        //禁用cache
    L1CACHE_EnableDCache();         //启用cache
    L1CACHE_CleanInvalidateDCache();//对所有的缓存清除并无效
    L1CACHE_CleanInvalidateDCacheByRange((uint32)test[0],50);//对test数组的缓存 清除并无效（即刷新）

    // 此处编写用户代码 例如外设初始化代码等
    
    while(1)
    {
        
    }
}


